YES = "✅"
NO = "❌"
QUESTION = "❓"
NO_DATA = "Н/д"
SUCCESS = f"{YES} Успешно!"

SET_TIMER_TEXT = (
    "🕛 Чтобы установить таймер на срабатывание через какое-то время, "
    "введите часы и минуты через точку, запятую или пробел "
    "<i>(0.30, 1 0, 12,45)</i>\n"
    "⏰ Чтобы установить таймер на срабатывание в какое-то время, "
    "введите это время через двоеточие <i>(12:30, 16:00, 19:50)</i>"
)

DONT_UNDERSTAND_DATE = (
    f"{NO} Не понял это как дату, попробуйте ещё раз. Формат - <b>ДД.ММ.ГГГГ</b>"
)
DONT_UNDERSTAND_TIMER = (
    f"{NO} Не понял это как часы и минуты. Попробуйте ещё раз.\n\n{SET_TIMER_TEXT}"
)
